# Concatenating Tables with Set-Like Operations

One of the two way of combining two tables is to stack one table on top of the other.  When stacking two tables on top of one another, we need to decide

1. If we combine columns based on position or name (and if combining by name, what do we do with mismatches?)
2. How to decide which rows to keep.  In this case, we will take some guidance from SQL clauses.

## Three Types of Operations

* **Union:** Keeps rows from either table.
* **Intersection:** Only keeps common columns
* **Set Difference/Except:** Keep rows from the left table *except* those in the right table.

## Set Operations in Action 

<img src="./img/table_verbs_set.gif" width=800>

## All Operations Match by Position

All operations

* Match columns by position
* Require same number/type of columns

## Distinct Versus All

* **UNION/INTERSECT/SET DIFFERENE** are **DISTINCT**
    * Only keeps distinct rows, removing duplicates.
* **UNION ALL/INTERSECT ALL/SET DIFFERENCE ALL**
    * Keeps duplicate rows

In [1]:
import pandas as pd
from dfply import *

In [2]:
sales_may = pd.read_csv('./data/auto_sales_may.csv')
sales_may

   Unnamed: 0 Salesperson  Compact  Sedan  SUV  Truck
0           0         Ann       22     18   15     12
1           1         Bob       20     14    6     24
2           2     Yolanda       19     10   28     17
3           3      Xerxes       11     27   17      9

In [3]:
sales_apr = pd.read_csv('./data/auto_sales_apr.csv')
sales_apr

   Unnamed: 0 Salesperson  Compact  Sedan  SUV  Truck
0           0         Ann       22     18   15     12
1           1         Bob       19     12   17     20
2           2     Yolanda       19      8   32     15
3           3      Xerxes       12     23   18      9

## Unions with `dfply`

Use `left_table >> union(right_table)`

In [4]:
sales_may >> union(sales_apr)

   Unnamed: 0 Salesperson  Compact  Sedan  SUV  Truck
0           0         Ann       22     18   15     12
1           1         Bob       20     14    6     24
2           2     Yolanda       19     10   28     17
3           3      Xerxes       11     27   17      9
1           1         Bob       19     12   17     20
2           2     Yolanda       19      8   32     15
3           3      Xerxes       12     23   18      9

## `dfply.union` is distinct

Since Ann have the same sales each month, her row only included one row.  Note that we can use `keep='last'` to `keep='first'` to determine which row is kept.

In [5]:
sales_may >> union(sales_apr, keep='last')

   Unnamed: 0 Salesperson  Compact  Sedan  SUV  Truck
1           1         Bob       20     14    6     24
2           2     Yolanda       19     10   28     17
3           3      Xerxes       11     27   17      9
0           0         Ann       22     18   15     12
1           1         Bob       19     12   17     20
2           2     Yolanda       19      8   32     15
3           3      Xerxes       12     23   18      9

In [6]:
sales_may >> union(sales_apr, keep='first')

   Unnamed: 0 Salesperson  Compact  Sedan  SUV  Truck
0           0         Ann       22     18   15     12
1           1         Bob       20     14    6     24
2           2     Yolanda       19     10   28     17
3           3      Xerxes       11     27   17      9
1           1         Bob       19     12   17     20
2           2     Yolanda       19      8   32     15
3           3      Xerxes       12     23   18      9

## Making `union_all`

We can use `pd.concat` to perform a `UNION ALL`

In [7]:
from more_dfply import union_all
sales_may >> union_all(sales_apr)

   Unnamed: 0 Salesperson  Compact  Sedan  SUV  Truck
0           0         Ann       22     18   15     12
1           1         Bob       20     14    6     24
2           2     Yolanda       19     10   28     17
3           3      Xerxes       11     27   17      9
4           0         Ann       22     18   15     12
5           1         Bob       19     12   17     20
6           2     Yolanda       19      8   32     15
7           3      Xerxes       12     23   18      9

## Adding a month column

Another way to keep both of Ann's sales rows is adding a month column (which we should probably do anyway).

In [8]:
sales_may >> mutate(month = 'May') >> union(sales_apr >> mutate(month = 'April'))

   Unnamed: 0 Salesperson  Compact  Sedan  SUV  Truck  month
0           0         Ann       22     18   15     12    May
1           1         Bob       20     14    6     24    May
2           2     Yolanda       19     10   28     17    May
3           3      Xerxes       11     27   17      9    May
0           0         Ann       22     18   15     12  April
1           1         Bob       19     12   17     20  April
2           2     Yolanda       19      8   32     15  April
3           3      Xerxes       12     23   18      9  April

## Finding common rows with `dfply.intersect`

In [9]:
sales_may >> intersect(sales_apr)

   Unnamed: 0 Salesperson  Compact  Sedan  SUV  Truck
0           0         Ann       22     18   15     12

## Finding rows unique to the left table.

Use `left_table >> dfply.set_diff(right_table)`

In [10]:
sales_may >> set_diff(sales_apr)

   Unnamed: 0 Salesperson  Compact  Sedan  SUV  Truck
1           1         Bob       20     14    6     24
2           2     Yolanda       19     10   28     17
3           3      Xerxes       11     27   17      9

## <font color="red"> Exercise 1 </font>

In the data folder, you will find 6 files that contain a sample 100,000 rows from the uber data for the month apr14-sep14.  Perform the following tasks:

1. Use `glob` to get all 6 file paths.
2. Use a regular expression to create a `lambda` function that pulls the month from the files.
3. Read the 6 data frames into a `dict` with keys equal to the month name and values containing the corresponding data frame.
4. Write a helper function that adds a month column each dictionary.  Use a dictionary comprehension to apply this helper to each `df`.
5. Use the accumulator pattern and `dfply.union` to combine these 6 data frames into one combined `df`
6. Inspect the head and shape of the resulting `df`

In [11]:
# Your code here
import glob
help(glob.glob)

Help on function glob in module glob:

glob(pathname, *, recursive=False)
    Return a list of paths matching a pathname pattern.

    The pattern may contain simple shell-style wildcards a la
    fnmatch. However, unlike fnmatch, filenames starting with a
    dot are special cases that are not matched by '*' and '?'
    patterns.

    If recursive is true, the pattern '**' will match any files and
    zero or more directories and subdirectories.

reading in the files and checking to make sure they were read

In [12]:
sales_files = glob.glob('./data/uber-raw-data*.csv')
sales_files

['./data/uber-raw-data-jun14-sample.csv',
 './data/uber-raw-data-may14-sample.csv',
 './data/uber-raw-data-aug14-sample.csv',
 './data/uber-raw-data-sep14-sample.csv',
 './data/uber-raw-data-apr14-sample.csv',
 './data/uber-raw-data-jul14-sample.csv']

In [13]:
sales_by_month = [pd.read_csv(f) for f in sales_files]

In [14]:
[df.head(2) for df in sales_by_month]

[            Date/Time      Lat      Lon    Base
 0  6/19/2014 16:49:00  40.7568 -73.9701  B02682
 1  6/12/2014 21:25:00  40.6463 -73.7768  B02598,
             Date/Time      Lat      Lon    Base
 0  5/31/2014 18:57:00  40.7660 -73.9714  B02682
 1  5/13/2014 21:19:00  40.7598 -73.9782  B02598,
             Date/Time      Lat      Lon    Base
 0  8/12/2014 19:19:00  40.7062 -74.0145  B02598
 1  8/30/2014 17:39:00  40.6400 -73.9672  B02764,
             Date/Time      Lat      Lon    Base
 0  9/29/2014 22:30:00  40.7848 -73.9540  B02682
 1  9/26/2014 10:41:00  40.7134 -73.9974  B02598,
             Date/Time      Lat      Lon    Base
 0  4/18/2014 21:38:00  40.7359 -73.9852  B02682
 1  4/23/2014 15:19:00  40.7642 -73.9543  B02598,
             Date/Time      Lat      Lon    Base
 0  7/29/2014 19:34:00  40.7140 -74.0144  B02682
 1  7/11/2014 10:24:00  40.7264 -73.9553  B02617]

In [16]:
import re

Month_RE = re.compile(r'./data/uber-raw-data-([a-z]{3})14-sample.csv')
[Month_RE.match(f).group(1) for f in sales_files]
get_month = lambda p: Month_RE.match(p).group(1)
month_names = lambda files: [get_month(p) for p in files]
month_names(sales_files)

['jun', 'may', 'aug', 'sep', 'apr', 'jul']

In [18]:
month_name_and_file = list(zip(month_names(sales_files), sales_files))
month_name_and_file

[('jun', './data/uber-raw-data-jun14-sample.csv'),
 ('may', './data/uber-raw-data-may14-sample.csv'),
 ('aug', './data/uber-raw-data-aug14-sample.csv'),
 ('sep', './data/uber-raw-data-sep14-sample.csv'),
 ('apr', './data/uber-raw-data-apr14-sample.csv'),
 ('jul', './data/uber-raw-data-jul14-sample.csv')]

In [20]:
uber_by_month = [(mon, pd.read_csv(file)) for mon, file in month_name_and_file]

In [22]:
[(mon, df.head(2)) for mon, df in uber_by_month]

[('jun',
              Date/Time      Lat      Lon    Base
  0  6/19/2014 16:49:00  40.7568 -73.9701  B02682
  1  6/12/2014 21:25:00  40.6463 -73.7768  B02598),
 ('may',
              Date/Time      Lat      Lon    Base
  0  5/31/2014 18:57:00  40.7660 -73.9714  B02682
  1  5/13/2014 21:19:00  40.7598 -73.9782  B02598),
 ('aug',
              Date/Time      Lat      Lon    Base
  0  8/12/2014 19:19:00  40.7062 -74.0145  B02598
  1  8/30/2014 17:39:00  40.6400 -73.9672  B02764),
 ('sep',
              Date/Time      Lat      Lon    Base
  0  9/29/2014 22:30:00  40.7848 -73.9540  B02682
  1  9/26/2014 10:41:00  40.7134 -73.9974  B02598),
 ('apr',
              Date/Time      Lat      Lon    Base
  0  4/18/2014 21:38:00  40.7359 -73.9852  B02682
  1  4/23/2014 15:19:00  40.7642 -73.9543  B02598),
 ('jul',
              Date/Time      Lat      Lon    Base
  0  7/29/2014 19:34:00  40.7140 -74.0144  B02682
  1  7/11/2014 10:24:00  40.7264 -73.9553  B02617)]

adding a column

In [43]:
uber_files_with_month = [(df
                          >> mutate(month = mon)
                        )
                        for mon, df in uber_by_month
                        ]

In [28]:
[df.head(2) for df in uber_files_with_month]

[            Date/Time      Lat      Lon    Base month
 0  6/19/2014 16:49:00  40.7568 -73.9701  B02682   jun
 1  6/12/2014 21:25:00  40.6463 -73.7768  B02598   jun,
             Date/Time      Lat      Lon    Base month
 0  5/31/2014 18:57:00  40.7660 -73.9714  B02682   may
 1  5/13/2014 21:19:00  40.7598 -73.9782  B02598   may,
             Date/Time      Lat      Lon    Base month
 0  8/12/2014 19:19:00  40.7062 -74.0145  B02598   aug
 1  8/30/2014 17:39:00  40.6400 -73.9672  B02764   aug,
             Date/Time      Lat      Lon    Base month
 0  9/29/2014 22:30:00  40.7848 -73.9540  B02682   sep
 1  9/26/2014 10:41:00  40.7134 -73.9974  B02598   sep,
             Date/Time      Lat      Lon    Base month
 0  4/18/2014 21:38:00  40.7359 -73.9852  B02682   apr
 1  4/23/2014 15:19:00  40.7642 -73.9543  B02598   apr,
             Date/Time      Lat      Lon    Base month
 0  7/29/2014 19:34:00  40.7140 -74.0144  B02682   jul
 1  7/11/2014 10:24:00  40.7264 -73.9553  B02617   jul]

In [42]:
joinedTables = pd.concat(uber_files_with_month)
joinedTables

                Date/Time      Lat      Lon    Base month
0      6/19/2014 16:49:00  40.7568 -73.9701  B02682   jun
1      6/12/2014 21:25:00  40.6463 -73.7768  B02598   jun
2      6/15/2014 22:23:00  40.7205 -73.9575  B02512   jun
3      6/14/2014 20:34:00  40.7639 -73.9624  B02617   jun
4      6/13/2014 14:36:00  40.7665 -73.9667  B02598   jun
...                   ...      ...      ...     ...   ...
99995    7/9/2014 7:17:00  40.7329 -73.9794  B02617   jul
99996  7/24/2014 13:34:00  40.6713 -73.9846  B02682   jul
99997   7/3/2014 10:06:00  40.7623 -73.9660  B02598   jul
99998   7/8/2014 22:21:00  40.7670 -73.9171  B02617   jul
99999  7/14/2014 17:01:00  40.7331 -73.9948  B02682   jul

[600000 rows x 5 columns]